# SetDXFExportOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..SetDXFExportOptions Method
ExportDWGSettings Class See Also
---
Sets the options stored in these settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetDXFExportOptions(
	DXFExportOptions options
)
```

Visual Basic
---
```text
Public Sub SetDXFExportOptions ( _
	options As DXFExportOptions _
)
```

Visual C++
---
```text
public:
void SetDXFExportOptions(
	DXFExportOptions^ options
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..DXFExportOptions The options.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace